ASh-en/LCD-lv-refactoring/STM32F7xx_EVAL/stm32f7xx_eval_lcd.c
/**
  ******************************************************************************
  * @file    stm32756g_eval_lcd.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    22-April-2016
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32756G-EVAL and STM32746G-EVAL evaluation boards.
  @verbatim
  How To use this driver:
  -----------------------
   - This driver is used to drive directly an LCD TFT using the LTDC controller.
   - This driver selects dynamically the mounted LCD, AMPIRE 640x480 LCD mounted 
     on MB1063 or AMPIRE 480x272 LCD mounted on MB1046 daughter board, 
     and uses the adequate timing and setting for the specified LCD using 
     device ID of the STMPE811 mounted on MB1046 daughter board.          

  Driver description:
  ------------------
  + Initialization steps:
     o Initialize the LCD using the BSP_LCD_Init() function.
     o Apply the Layer configuration using the BSP_LCD_LayerDefaultInit() function.    
     o Select the LCD layer to be used using the BSP_LCD_SelectLayer() function.
     o Enable the LCD display using the BSP_LCD_DisplayOn() function.

  + Options
     o Configure and enable the colour keying functionality using the 
       BSP_LCD_SetColorKeying() function.
     o Modify in the fly the transparency and/or the frame buffer address
       using the following functions:
       - BSP_LCD_SetTransparency()
       - BSP_LCD_SetLayerAddress() 
  
  + Display on LCD
     o Clear the whole LCD using BSP_LCD_Clear() function or only one specified string
       line using the BSP_LCD_ClearStringLine() function.
     o Display a character on the specified line and column using the BSP_LCD_DisplayChar()
       function or a complete string line using the BSP_LCD_DisplayStringAtLine() function.
     o Display a string line on the specified position (x,y in pixel) and align mode
       using the BSP_LCD_DisplayStringAtLine() function.          
     o Draw and fill a basic shapes (dot, line, rectangle, circle, ellipse, .. bitmap) 
       on LCD using the available set of functions.     
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_eval_lcd.h"
#include "../../../Components/Fonts/fonts.h"
#include "../../../Components/Fonts/font24_1.c"
#include "../../../Components/Fonts/font48.c"
#include "../../../Components/Fonts/font24.c"
#include "../../../Components/Fonts/font20.c"
#include "../../../Components/Fonts/font16.c"
#include "../../../Components/Fonts/font12.c"
#include "../../../Components/Fonts/font8.c"



/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32756G_EVAL
  * @{
  */
    
/** @addtogroup STM32756G_EVAL_LCD
  * @{
  */ 

/** @defgroup STM32756G_EVAL_LCD_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 

/** @defgroup STM32756G_EVAL_LCD_Private_Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))      
/**
  * @}
  */ 

/** @defgroup STM32756G_EVAL_LCD_Private_Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))      
/**
  * @}
  */ 
    
/** @defgroup STM32756G_EVAL_LCD_Private_Variables
  * @{
  */ 
LTDC_HandleTypeDef  hLtdcEval;
static DMA2D_HandleTypeDef hDma2dEval;
static uint32_t            PCLK_profile = LCD_MAX_PCLK;
/* Default LCD configuration with LCD Layer 1 */
//static uint32_t            ActiveLayer = 0;
//static LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
 uint32_t            ActiveLayer = 0;
 LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
/**
  * @}
  */ 

/** @defgroup STM32756G_EVAL_LCD_Private_FunctionPrototypes
  * @{
  */ 
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c);
static void FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3);
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex);
static void LL_ConvertLineToARGB8888(void * pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode);
extern uint32_t GetChineseFont_From_SD(uint8_t *pBuffer, uint16_t Code, char *FileName,uint32_t FileSize);
/**
  * @}
  */ 

/** @defgroup STM32756G_EVAL_LCD_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the LCD.
  * @retval LCD state
  */
uint8_t BSP_LCD_Init(void)
{    
  return (BSP_LCD_InitEx(LCD_MAX_PCLK));
}

/**
  * @brief  Initializes the LCD.
  * @param  PclkConfig : pixel clock profile
  * @retval LCD state
  */
uint8_t BSP_LCD_InitEx(uint32_t PclkConfig)
{    
  PCLK_profile = PclkConfig;
  /* Select the used LCD */
#ifdef USE_480x272
    /* The AMPIRE LCD 480x272 is selected */
    /* Timing Configuration */    
    hLtdcEval.Init.HorizontalSync = (AMPIRE480272_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (AMPIRE480272_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (AMPIRE480272_HSYNC + AMPIRE480272_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (AMPIRE480272_VSYNC + AMPIRE480272_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (AMPIRE480272_HEIGHT + AMPIRE480272_VSYNC + AMPIRE480272_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (AMPIRE480272_WIDTH + AMPIRE480272_HSYNC + AMPIRE480272_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (AMPIRE480272_HEIGHT + AMPIRE480272_VSYNC + AMPIRE480272_VBP + AMPIRE480272_VFP - 1);
    hLtdcEval.Init.TotalWidth = (AMPIRE480272_WIDTH + AMPIRE480272_HSYNC + AMPIRE480272_HBP + AMPIRE480272_HFP - 1);
    
		/* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = AMPIRE480272_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = AMPIRE480272_HEIGHT;  
#endif	
#ifdef USE_640x480
		/* The LCD AMPIRE 640x480 is selected */
    /* Timing configuration */
    hLtdcEval.Init.HorizontalSync = (AMPIRE640480_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (AMPIRE640480_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (AMPIRE640480_HSYNC + AMPIRE640480_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (AMPIRE640480_VSYNC + AMPIRE640480_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (AMPIRE640480_HEIGHT + AMPIRE640480_VSYNC + AMPIRE640480_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (AMPIRE640480_WIDTH + AMPIRE640480_HSYNC + AMPIRE640480_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (AMPIRE640480_HEIGHT + AMPIRE640480_VSYNC + AMPIRE640480_VBP + AMPIRE640480_VFP - 1);
    hLtdcEval.Init.TotalWidth = (AMPIRE640480_WIDTH + AMPIRE640480_HSYNC + AMPIRE640480_HBP + AMPIRE640480_HFP - 1); 
		
    /* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = AMPIRE640480_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = AMPIRE640480_HEIGHT;
#endif
#if defined (USE_800x480) || defined (USE_800x480_FT5206)
    /* The 640x480 LCD is selected */
    /* Timing Configuration */    
    hLtdcEval.Init.HorizontalSync = (AT800480_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (AT800480_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (AT800480_HSYNC + AT800480_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (AT800480_VSYNC + AT800480_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP + AT800480_VFP - 1);
    hLtdcEval.Init.TotalWidth = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP + AT800480_HFP - 1);
		
    /* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = AT800480_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = AT800480_HEIGHT;
#endif
#if defined (USE_800x600) || defined (USE_800x600_TOUCH)
    /* The 800x600 LCD is selected */
    /* Timing Configuration */    
    hLtdcEval.Init.HorizontalSync = (G104SN03_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (G104SN03_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (G104SN03_HSYNC + G104SN03_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (G104SN03_VSYNC + G104SN03_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (G104SN03_HEIGHT + G104SN03_VSYNC + G104SN03_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (G104SN03_WIDTH + G104SN03_HSYNC + G104SN03_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (G104SN03_HEIGHT + G104SN03_VSYNC + G104SN03_VBP + G104SN03_VFP - 1);
    hLtdcEval.Init.TotalWidth = (G104SN03_WIDTH + G104SN03_HSYNC + G104SN03_HBP + G104SN03_HFP - 1);
		
    /* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = G104SN03_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = G104SN03_HEIGHT;
#endif
#if defined (USE_1024x600) || defined (USE_1024x600_TOUCH)
		/* The 1024x600 LCD is selected */
    /* Timing Configuration */    
    hLtdcEval.Init.HorizontalSync = (N101L6_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (N101L6_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (N101L6_HSYNC + N101L6_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (N101L6_VSYNC + N101L6_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (N101L6_HEIGHT + N101L6_VSYNC + N101L6_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (N101L6_WIDTH + N101L6_HSYNC + N101L6_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (N101L6_HEIGHT + N101L6_VSYNC + N101L6_VBP + N101L6_VFP - 1);
    hLtdcEval.Init.TotalWidth = (N101L6_WIDTH + N101L6_HSYNC + N101L6_HBP + N101L6_HFP - 1);

		/* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = N101L6_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = N101L6_HEIGHT;
#endif
#if defined (USE_1024x768) || defined (USE_1024x768_TOUCH)
		/* The 1024x768 LCD is selected */
    /* Timing Configuration */    
    hLtdcEval.Init.HorizontalSync = (HT21X21_HSYNC - 1);
    hLtdcEval.Init.VerticalSync = (HT21X21_VSYNC - 1);
    hLtdcEval.Init.AccumulatedHBP = (HT21X21_HSYNC + HT21X21_HBP - 1);
    hLtdcEval.Init.AccumulatedVBP = (HT21X21_VSYNC + HT21X21_VBP - 1);  
    hLtdcEval.Init.AccumulatedActiveH = (HT21X21_HEIGHT + HT21X21_VSYNC + HT21X21_VBP - 1);
    hLtdcEval.Init.AccumulatedActiveW = (HT21X21_WIDTH + HT21X21_HSYNC + HT21X21_HBP - 1);
    hLtdcEval.Init.TotalHeigh = (HT21X21_HEIGHT + HT21X21_VSYNC + HT21X21_VBP + HT21X21_VFP - 1);
    hLtdcEval.Init.TotalWidth = (HT21X21_WIDTH + HT21X21_HSYNC + HT21X21_HBP + HT21X21_HFP - 1);
		
    /* Initialize the LCD pixel width and pixel height */
    hLtdcEval.LayerCfg->ImageWidth  = HT21X21_WIDTH;
    hLtdcEval.LayerCfg->ImageHeight = HT21X21_HEIGHT;
#endif
  
  /* Background value */
  hLtdcEval.Init.Backcolor.Blue = 0;
  hLtdcEval.Init.Backcolor.Green = 0;
  hLtdcEval.Init.Backcolor.Red = 0;
  
  /* Polarity */
  hLtdcEval.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hLtdcEval.Init.VSPolarity = LTDC_VSPOLARITY_AL; 
  hLtdcEval.Init.DEPolarity = LTDC_DEPOLARITY_AL;  
  hLtdcEval.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
	

  hLtdcEval.Instance = LTDC;
  
